app/views/infraccions/_form.html.erb

    <%= form.label :infractor_id %>
    <%= form.collection_select :infractor_id, Infractor.all, :id, :nombre %>
---
SELECT "infractors".* FROM "infractors"

    <%= form.label :tipo_infraccion_id %>
    <%= form.collection_select :tipo_infraccion_id, TipoInfraccion.all, :id, :nombre  %>
---
SELECT "tipo_infraccions".* FROM "tipo_infraccions"

    <%= form.label :vehiculo_id %>
    <%= form.collection_select :vehiculo_id,  Vehiculo.all, :id, :placa  %>
---
SELECT "vehiculos".* FROM "vehiculos"