app/views/inscripcions/_form.html.erb

SELECT "estudiantes".* FROM "estudiantes"
---
    <%= form.label :estudiante_id %>
    <%= form.collection_select :estudiante_id, Estudiante.all, :id, :nombre, :apellido_paterno  %>

SELECT "cursos".* FROM "cursos"
---
    <%= form.label :curso_id %>
    <%= form.collection_select :curso_id, Curso.all %>