app/views/reportes/index.html.erb

SELECT "rastreos".* FROM "rastreos" WHERE "rastreos"."empleado_id" = $1  [["empleado_id", 1]]
---
  </h3>
      <% empleado.rastreos.each do |empleado_rastreo| %>