app/views/empleados/show.html.erb

SELECT "rastreos".* FROM "rastreos" WHERE "rastreos"."empleado_id" = $1  [["empleado_id", 2]]
---
  <h2>Mis ubicaciones rastreadas</h2>
  <% @empleado.rastreos.each do |rastreo| %>

SELECT "lugar_de_trabajos".* FROM "lugar_de_trabajos" WHERE "lugar_de_trabajos"."empleado_id" = $1  [["empleado_id", 1]]
---
  <h2>Mis Lugares de trabajo</h2>
  <% @empleado.lugar_de_trabajos.each do |lugar_de_trabajo| %>