app/controllers/courses_controller.rb

INSERT INTO "courses" ("numero", "nivel", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["numero", 1], ["nivel", "primario"], ["teacher_id", 1], ["created_at", "2018-04-15 20:30:31.387746"], ["updated_at", "2018-04-15 20:30:31.387746"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save