app/controllers/cursos_controller.rb

  def create
    @curso = Curso.new(curso_params)

    respond_to do |format|
      if @curso.save
---
INSERT INTO "cursos" ("numero", "created_at", "updated_at", "grado") VALUES ($1, $2, $3, $4) RETURNING "id"  [["numero", 3], ["created_at", "2018-07-18 14:30:25.463280"], ["updated_at", "2018-07-18 14:30:25.463280"], ["grado", "B"]]

  def destroy
    @curso.destroy
---
DELETE FROM "cursos" WHERE "cursos"."id" = $1  [["id", 1]]