app/controllers/empleados_controller.rb

  def lugar_rastreo
    @empleados = Empleado.all
---
SELECT "empleados".* FROM "empleados"

  def index
    @empleados = Empleado.all
---
SELECT "empleados".* FROM "empleados"

  def create
    @empleado = Empleado.new(empleado_params)

    respond_to do |format|
      if @empleado.save
---
INSERT INTO "empleados" ("nombre", "apellido", "cargo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "beymar"], ["apellido", "darlin"], ["cargo", "tecnico"], ["created_at", "2018-09-23 05:44:33.583926"], ["updated_at", "2018-09-23 05:44:33.583926"]]

    def set_empleado
      @empleado = Empleado.find(params[:id])
---
SELECT  "empleados".* FROM "empleados" WHERE "empleados"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]