app/controllers/estudiantes_controller.rb

  def index
    @estudiantes = Estudiante.all
---
SELECT "estudiantes".* FROM "estudiantes"

  def create
    @estudiante = Estudiante.new(estudiante_params)

    respond_to do |format|
      if @estudiante.save
---
INSERT INTO "estudiantes" ("nombre", "apellido_paterno", "apellido_materno", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "diego"], ["apellido_paterno", "mansilla"], ["apellido_materno", " chavez"], ["created_at", "2018-06-15 17:30:50.259428"], ["updated_at", "2018-06-15 17:30:50.259428"]]

    def set_estudiante
      @estudiante = Estudiante.find(params[:id])
---
SELECT  "estudiantes".* FROM "estudiantes" WHERE "estudiantes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]