app/controllers/fathers_controller.rb

  def read_notes
    @current_father_id = get_current_father.id
    @student_from_father_id = Student.find_by(father_id: @current_father_id ).id
    @notes = Note.find_by(student_id: @student_from_father_id)
---
SELECT  "students".* FROM "students" WHERE "students"."father_id" = $1 LIMIT $2  [["father_id", 99637968], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."student_id" = $1 LIMIT $2  [["student_id", 1], ["LIMIT", 1]]

  def index
    @fathers = Father.all
---
SELECT "fathers".* FROM "fathers"

  def create
    @father = Father.new(father_params)

    respond_to do |format|
      if @father.save
---
INSERT INTO "fathers" ("nombre", "apellido", "celular", "tipo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", "felix"], ["apellido", "mansilla"], ["celular", "71617925"], ["tipo", 1], ["created_at", "2018-04-15 21:58:38.687616"], ["updated_at", "2018-04-15 21:58:38.687616"]]

    def set_father
      @father = Father.find(params[:id])
---
SELECT  "fathers".* FROM "fathers" WHERE "fathers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]