app/controllers/infraccions_controller.rb

SELECT "infraccions".* FROM "infraccions"
---
  def index
    @infraccions = Infraccion.all