app/controllers/infrastructures_controller.rb

SELECT "infrastructures".* FROM "infrastructures"
---
  def index
    @infrastructures = Infrastructure.all