app/controllers/infractors_controller.rb

SELECT "infractors".* FROM "infractors"
---
  def index
    @infractors = Infractor.all