app/controllers/inscripcions_controller.rb

  def index
    @inscripcions = Inscripcion.all
---
SELECT "inscripcions".* FROM "inscripcions"

  def create
    @inscripcion = Inscripcion.new(inscripcion_params)

    respond_to do |format|
      if @inscripcion.save
---
INSERT INTO "inscripcions" ("fecha", "estudiante_id", "curso_id", "monto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["fecha", "2018-06-15"], ["estudiante_id", 1], ["curso_id", 1], ["monto", 100], ["created_at", "2018-06-15 21:45:58.077992"], ["updated_at", "2018-06-15 21:45:58.077992"]]

  def destroy
    @inscripcion.destroy
---
DELETE FROM "inscripcions" WHERE "inscripcions"."id" = $1  [["id", 2]]

    def set_inscripcion
      @inscripcion = Inscripcion.find(params[:id])
---
SELECT  "inscripcions".* FROM "inscripcions" WHERE "inscripcions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]