app/controllers/lugar_de_trabajos_controller.rb

  def index
    @lugar_de_trabajo = LugarDeTrabajo.all
---
SELECT "lugar_de_trabajos".* FROM "lugar_de_trabajos"

    def create
      @empleado = Empleado.find(params[:empleado_id])
      @lugar_de_trabajo = @empleado.lugar_de_trabajos.create(lugar_de_trabajo_params)
---
SELECT  "empleados".* FROM "empleados" WHERE "empleados"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "lugar_de_trabajos" ("zona", "empleado_id", "created_at", "updated_at", "direccion", "descripcion") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["zona", "oeste"], ["empleado_id", 1], ["created_at", "2018-09-26 20:05:37.969981"], ["updated_at", "2018-09-26 20:05:37.969981"], ["direccion", "la guardia"], ["descripcion", "instalar antena"]]

  def google_maps
    @lugar_de_trabajo = LugarDeTrabajo.all
---
SELECT "lugar_de_trabajos".* FROM "lugar_de_trabajos"