app/controllers/notes_controller.rb

INSERT INTO "notes" ("teacher_id", "student_id", "materia", "fecha_destino", "body", "estado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save