app/controllers/padres_controller.rb

  def index
    @padres = Padre.all
---
SELECT "padres".* FROM "padres"

  def create
    @padre = Padre.new(padre_params)

    respond_to do |format|
      if @padre.save
---
INSERT INTO "padres" ("name", "apellido", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "muchacho"], ["apellido", "mamani"], ["created_at", "2018-04-08 21:40:15.383383"], ["updated_at", "2018-04-08 21:40:15.383383"]]

    def set_padre
      @padre = Padre.find(params[:id])
---
SELECT  "padres".* FROM "padres" WHERE "padres"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]