app/controllers/paralelos_controller.rb

SELECT "paralelos".* FROM "paralelos"
---
  def index
    @paralelos = Paralelo.all

INSERT INTO "paralelos" ("letra", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["letra", "A"], ["created_at", "2018-06-15 17:08:50.558667"], ["updated_at", "2018-06-15 17:08:50.558667"]]
---
  def create
    @paralelo = Paralelo.new(paralelo_params)

    respond_to do |format|
      if @paralelo.save

SELECT  "paralelos".* FROM "paralelos" WHERE "paralelos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_paralelo
      @paralelo = Paralelo.find(params[:id])