app/controllers/rastreos_controller.rb

  def create
    @empleado = Empleado.find(params[:empleado_id])
    @rastreo = Rastreo.new(rastreo_params)
    @rastreo.save
---
SELECT  "empleados".* FROM "empleados" WHERE "empleados"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "rastreos" ("latitud", "longitud", "empleado_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["latitud", 3333333333333.0], ["longitud", 33333333333.0], ["empleado_id", 4], ["created_at", "2018-09-23 16:38:20.688458"], ["updated_at", "2018-09-23 16:38:20.688458"]]