app/controllers/reportes_controller.rb

  def index
    @empleados = Empleado.all
---
SELECT "empleados".* FROM "empleados"