app/controllers/students_controller.rb

INSERT INTO "students" ("course_id", "father_id", "nombre", "apellido", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["course_id", 1], ["father_id", 1], ["nombre", "diego"], ["apellido", "mansilla"], ["created_at", "2018-04-15 21:59:17.009725"], ["updated_at", "2018-04-15 21:59:17.009725"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save