app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("nombre", "apellido", "celular", "direccion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", "rolando"], ["apellido", "martinez"], ["celular", "71625378"], ["direccion", "uagrm"], ["created_at", "2018-04-15 19:53:29.438275"], ["updated_at", "2018-04-15 19:53:29.438275"]]
---
  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save