app/controllers/tipo_infraccions_controller.rb

  def index
    @tipo_infraccions = TipoInfraccion.all
---
SELECT "tipo_infraccions".* FROM "tipo_infraccions"

  def create
    @tipo_infraccion = TipoInfraccion.new(tipo_infraccion_params)

    respond_to do |format|
      if @tipo_infraccion.save
---
INSERT INTO "tipo_infraccions" ("nombre", "monto", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "Mal parqueado"], ["monto", 20], ["created_at", "2018-06-01 09:01:27.170677"], ["updated_at", "2018-06-01 09:01:27.170677"]]

    def set_tipo_infraccion
      @tipo_infraccion = TipoInfraccion.find(params[:id])
---
SELECT  "tipo_infraccions".* FROM "tipo_infraccions" WHERE "tipo_infraccions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]