app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password", "type_user", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "diego"], ["password", "mansilla"], ["type_user", "padre"], ["created_at", "2018-05-01 22:46:22.156976"], ["updated_at", "2018-05-01 22:46:22.156976"]]