app/controllers/vehiculos_controller.rb

  def index
    @vehiculos = Vehiculo.all
---
SELECT "vehiculos".* FROM "vehiculos"

  def create
    @vehiculo = Vehiculo.new(vehiculo_params)

    respond_to do |format|
      if @vehiculo.save
---
INSERT INTO "vehiculos" ("placa", "marca", "modelo", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["placa", "314o5iu"], ["marca", "toyota"], ["modelo", "93"], ["color", "blanco con azul"], ["created_at", "2018-06-01 08:57:58.229002"], ["updated_at", "2018-06-01 08:57:58.229002"]]

    def set_vehiculo
      @vehiculo = Vehiculo.find(params[:id])
---
SELECT  "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]